In [2]:
import pandas as pd
import mysql.connector as sql

In [4]:
con=sql.connect(host='localhost', user='root', password='',database='hms')

In [6]:
db_cursor=con.cursor()

In [16]:
db_cursor.execute("select * from Region")

In [17]:
all_rows=db_cursor.fetchall()

In [18]:
df=pd.DataFrame(all_rows)

In [21]:
df.head(10)

   0       1            2            3           4  5  6
0  1  Oromia  Addis Ababa  353,690 km²  2024-04-09     1
1  2  Amhara    Bahir Dar  154,709 km²  2024-04-09     1
2  3  Somale      Jigjiga       1.2 m2  2024-04-09     1
3  4    Afar       Samara   72,053 km²  2024-04-10  1  1
4  5  Tigray       Mekele   50,079 km²  2024-04-11  1  1

In [24]:
df.head()

   0       1            2            3           4  5  6
0  1  Oromia  Addis Ababa  353,690 km²  2024-04-09     1
1  2  Amhara    Bahir Dar  154,709 km²  2024-04-09     1
2  3  Somale      Jigjiga       1.2 m2  2024-04-09     1
3  4    Afar       Samara   72,053 km²  2024-04-10  1  1
4  5  Tigray       Mekele   50,079 km²  2024-04-11  1  1

In [25]:
df.describe()

<bound method NDFrame.describe of    0       1            2            3           4  5  6
0  1  Oromia  Addis Ababa  353,690 km²  2024-04-09     1
1  2  Amhara    Bahir Dar  154,709 km²  2024-04-09     1
2  3  Somale      Jigjiga       1.2 m2  2024-04-09     1
3  4    Afar       Samara   72,053 km²  2024-04-10  1  1
4  5  Tigray       Mekele   50,079 km²  2024-04-11  1  1>

In [26]:
df.describe()

              0    6
count  5.000000  5.0
mean   3.000000  1.0
std    1.581139  0.0
min    1.000000  1.0
25%    2.000000  1.0
50%    3.000000  1.0
75%    4.000000  1.0
max    5.000000  1.0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      int64
 1   1       5 non-null      object
 2   2       5 non-null      object
 3   3       5 non-null      object
 4   4       5 non-null      object
 5   5       5 non-null      object
 6   6       5 non-null      int64
dtypes: int64(2), object(5)
memory usage: 408.0+ bytes

In [28]:
df.dropna(axis=True)

   0       1            2            3           4  5  6
0  1  Oromia  Addis Ababa  353,690 km²  2024-04-09     1
1  2  Amhara    Bahir Dar  154,709 km²  2024-04-09     1
2  3  Somale      Jigjiga       1.2 m2  2024-04-09     1
3  4    Afar       Samara   72,053 km²  2024-04-10  1  1
4  5  Tigray       Mekele   50,079 km²  2024-04-11  1  1